src/Catalogs/Scan_ДрафтыПродуктов/Scan_ДрафтыПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ДрафтыПродуктов</name>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментРынкаПродуктов</name>
    <type>
      <types>CatalogRef.Scan_СегментыРынкаПродуктов</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Scan_ДрафтыПродуктов/ManagerModule.bsl
//rarus vikhle 24.08.2020 mt 16181 +++

//Обновляет наименование драфта в соответствии с измененными составляющими наименования
Процедура ОбновитьНаименованиеДрафта(СсылкаНаИзмененныйЭлемент) Экспорт
	Если СсылкаНаИзмененныйЭлемент.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ДрафтыПродуктов.Ссылка КАК Ссылка,
	               |	Scan_ДрафтыПродуктов.Модель КАК Модель,
	               |	Scan_ДрафтыПродуктов.Модель.МаркаПродукта КАК МодельМаркаПродукта,
	               |	Scan_ДрафтыПродуктов.СегментРынкаПродуктов КАК СегментРынкаПродуктов
	               |ИЗ
	               |	Справочник.Scan_ДрафтыПродуктов КАК Scan_ДрафтыПродуктов";
	Если ТипЗнч(СсылкаНаИзмененныйЭлемент) = Тип("СправочникСсылка.Scan_МаркиПродуктов") Тогда
		Запрос.Текст = Запрос.Текст + " ГДЕ Scan_ДрафтыПродуктов.Модель.МаркаПродукта = &СсылкаНаИзмененныйЭлемент";	
	ИначеЕсли ТипЗнч(СсылкаНаИзмененныйЭлемент) = Тип("СправочникСсылка.Scan_МоделиПродуктов") Тогда
		Запрос.Текст = Запрос.Текст + " ГДЕ Scan_ДрафтыПродуктов.Модель = &СсылкаНаИзмененныйЭлемент";	
	//rarus vikhle 05.11.2020 mt 16723 +++	
	//ИначеЕсли ТипЗнч(СсылкаНаИзмененныйЭлемент) = Тип("СправочникСсылка.Scan_МаркетинговыеТипыПродуктов") Тогда
	//	Запрос.Текст = Запрос.Текст + " ГДЕ Scan_ДрафтыПродуктов.МаркетинговыйТип = &СсылкаНаИзмененныйЭлемент";
	//rarus vikhle 05.11.2020 mt 16723 ---	
	ИначеЕсли ТипЗнч(СсылкаНаИзмененныйЭлемент) = Тип("СправочникСсылка.Scan_СегментыРынкаПродуктов") Тогда
		Запрос.Текст = Запрос.Текст + " ГДЕ Scan_ДрафтыПродуктов.СегментРынкаПродуктов = &СсылкаНаИзмененныйЭлемент";		
	КонецЕсли;
	Запрос.УстановитьПараметр("СсылкаНаИзмененныйЭлемент",СсылкаНаИзмененныйЭлемент);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДрафтОбъект = Выборка.Ссылка.ПолучитьОбъект();
		//ДрафтОбъект.Наименование = СокрЛП(?(ЗначениеЗаполнено(ДрафтОбъект.МаркетинговыйТип),ДрафтОбъект.МаркетинговыйТип.Наименование + " ","")  
		ДрафтОбъект.Наименование = СокрЛП(?(ЗначениеЗаполнено(ДрафтОбъект.СегментРынкаПродуктов),ДрафтОбъект.СегментРынкаПродуктов.Наименование + " ","") //rarus vikhle 05.11.2020 mt 16723 
								  + ?(ЗначениеЗаполнено(ДрафтОбъект.Модель.МаркаПродукта),ДрафтОбъект.Модель.МаркаПродукта.Наименование + " ","") 
								  + ?(ЗначениеЗаполнено(ДрафтОбъект.Модель),ДрафтОбъект.Модель.Наименование,""));
		Попытка						  
			ДрафтОбъект.Записать();	
		Исключение
			ЗаписьЖурналаРегистрации("Обновление наименования драфта продукта",
										УровеньЖурналаРегистрации.Ошибка,,ДрафтОбъект.Ссылка,
										"Произошла ошибка при записи драфта");
		КонецПопытки;	
	КонецЦикла;	
КонецПроцедуры
//rarus vikhle 24.08.2020 mt 16181 ---
